clear;
% clc;
close all;

%% forward kinematics test
% l1 = PA = 37.95
% l2 = AB = 184.12
% l3 = BC = 26.88
% l4 = BE = 162
% l5 = CD = 151.50
% l6 = DE = 37
% α = ∠EDQ = 62°
% l7 =DQ = 58.50 
X_test = [37.95 , 184.12 , 26.88 , 162 , 151.50 , 37 , deg2rad(62) , 58.50];
R = 150; % pipe radius
% theta1 = deg2rad(31.85); % angle (+x)AB
% theta2 = deg2rad(180 - 47.51); % angle ABE
% figID = 2;
% forward(X_test , [theta1 , theta2] , R , figID)

%% 线段与圆的交点测试
% P0 = [0 , 2];
% P1 = [2 , 0];
% center = [0 , 0];
% radius = 2;
% intersections = lineCircleIntersection(P0, P1, center, radius);
% disp('Intersections:');
% disp(intersections);

% pointToLineDistance([0.5,0.5], [0,0], [1,1])

%% 优化测试
% X = [37.95 , 184.12 , 26.88 , 152 , 151.50 , 37 , deg2rad(73) , 58.50];   % 初始尺寸参数
% X = [30.2593  212.0416   30.5898  131.1689  123.6822   35.4933    1.2935   80.2478]; % 第一次遗传算法结果
X = [ 44.1914 , 194.2010 ,  26.4953 , 161.8689 , 144.7455 , 35.2981 , 1.0204 , 46.2537]; % 第2次结果
X = [ 45.7496, 205.0989  , 32.0767 , 194.6602 , 168.0215 ,  50.0563  ,  0.8459 , 46.5043]; % 第2次结果
X = [ 28.5687,  212.8211 ,  24.9147  ,133.6850 , 117.4754 ,  33.7623 ,  1.0526 , 71.0416]; % 第3次结果
X = [ 30.4967  218.0399   46.3378  133.8716  129.7140   48.8814    1.4469   78.8111]; % 第4次结果
X = [ 37.6875  220.3372   30.6727  147.2665  127.5467   37.4712    0.1964   89.9767]; % 第5次结果  PSO + GA 感觉像是角度的上下界出了问题
X = [ 31.5688  257.4793   44.5030  186.5346  205.5253   51.0626   -4.4427   31.5687]; % 第6次结果
X = [ 34.9403  249.4776   35.9875  164.6266  170.6490   35.1976    1.7450   45.1360]; % 第7次结果 GA最优个体: 156 只使用GA, 100 , 400
X = [ 29.2326  245.5545   37.8013  174.2827  173.9202   44.4368    1.4132   57.0816]; % 第8次结果 GA最优个体: 97.3 使用GA + sqp
X = [59.8448  175.3350   23.9903  184.8515  188.7162   45.6815    1.5670   47.7451]; % 第9次结果 GA最优个体: 157.4 使用GA + sqp 
X = [30.2544  215.3711   27.6934  164.1476  163.4528   45.5298    1.4425   50.7422 ]; % 第10次优化结果 最优个体: 89.4923 使用 PSO + sqp  PSO 1000 , 50  sqp 200 , 5000
X = [23.7896  245.4786   40.6748  176.8192  174.1552   49.9993    1.4137   46.3393 ]; % 第11次优化结果 最优个体: 76.8748 使用 PSO + sqp  PSO 2000 , 100  sqp 200 , 5000
X = [20.0469  245.3324   33.4328  132.6371  122.0213   45.8533    1.2888   75.1054 ]; % 第12次优化结果 最优个体: 57·1370 使用 PSO + sqp  PSO 2500 , 100  sqp 200 , 5000
R = 180; % pipe radius
ticStart = tic;                       % <-- 计时开始
[optimal_theta, min_loss] = sub_score_1(X, R , -1);
opt_time = toc(ticStart);             % <-- 计时结束
fprintf('Optimization elapsed time: %.3f ms\n', opt_time * 1000);
% 评估最终损失与相关数据
lossFunction1(optimal_theta , X, R , 2 , 1);

